# task 01 == Виправте синтаксичні помилки
print("Hello", end=" ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = 4 * apples

# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print("Периметр фігури:", perimetery)


""" 
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""

# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
# Кількість яблунь у саду
apple_trees = 4

# Кількість груш у саду - на 5 більше яблунь
pear_trees = apple_trees + 5

# Кількість слив у саду - на 2 менше
plum_trees = apple_trees - 2

# Всього посадили дерев у саду
total_trees = apple_trees + pear_trees + plum_trees

# Виведення скільки всього посадили дерев у саду
print("Всього дерев посадили в саду:", total_trees)
 

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
# Температура повітря до обіда - на 5 градусів вище нуля
air_temp_before_lunch = 0 + 5

# Температура повітря після обіду - опустилася на 10 градусів
air_temp_after_lunch = air_temp_before_lunch - 10

# Температура повітря надвечір - потепліло на 4 градуси- 
air_temp_in_the_evening = air_temp_after_lunch + 4

# Виведення яка температура повітря надвечір
print("Надвечір температура повітря була", air_temp_in_the_evening, "градус нище нуля")


# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
# Всього хлопчиків у театральному гуртку
boys_theater = 24

# Всього дівчаток у театральному гуртку
girls_theater = boys_theater / 2

# Хлопчиків у театральному гуртку сьогодні - 1 захворів
boys_theater_today = boys_theater - 1

# Дівчаток у театральному гуртку сьогодні - 2 не прийшли
girls_theater_today = girls_theater - 2

# Сьогодні дітей у театральному гуртку
total_children_today = boys_theater_today + girls_theater_today

# Виведення скількі сьогодні дітей у театральному гуртку
print("Сьогодні дітей у театральному гуртку:", total_children_today)


# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
# Вартість першої книги
first_book_price = 8

# Вартість другої книги - на 2 грн. дороже
second_book_price = first_book_price + 2

# Вартість третьої книги - половина вартості першої та другої разом
third_book_price = (first_book_price + second_book_price) / 2

# Скільки будуть коштувати усі книги, якщо купити по одному примірнику
total_price = first_book_price + second_book_price + third_book_price

# Виведення загальної вартості
print("Загальна вартість усіх трьох книг, якщо купити по одному примірнику:", total_price, "грн")



