# task 01 == Виправте синтаксичні помилки
print("Hello", end = "world!")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = 4*apples

# task 05 == виправте назви змінних
side_1 = 1
side_2 = 2
side_3 = 3
side_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
side_1 = 1
side_2 = 2
side_3 = 3
side_4 = 4
perimetery = side_1+side_2+side_3+side_4
print(perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
#Обьявляем переменную.
Apple_tree = 4

#Обьявляем вторую переменную.
Pear_tree = Apple_tree*5

#Обьявляем третью переменную.
Plum_tree = Apple_tree-2

#Выводим сумму переменных.
print(Apple_tree+Pear_tree+Plum_tree,"дерева/дерев")


# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
#Обьявляем переменную.
Before_noon = +5

#Обьявляем вторую переменную и проводим вычисления.
After_noon = Before_noon-10

#Обьявляем переменную и проводим конечное вычисление.
In_the_evening = After_noon+4

#Выводим читаемый результат.
print("Температура надвечір",In_the_evening,"°C")
# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
#Общее количество девочек и мальчиков.
boys = 24
girls = boys/2

#Дети, которые не пришли.
sick_boys = 1
absent_girls = 2

#Дети, которые пришли.
present_boys = int(boys-sick_boys)
present_girls = int(girls-absent_girls)

#Подсчет сегоднешнего количества детей в театре.
print("Сьогодні в театральному гуртку прийшло",present_boys+present_girls,"дитини/дітей")

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
#Обьявляем переменную.
First_book = 8
#Обьявляем вторую переменную в зависимости от условия.
Second_book = First_book+2
#Обьявляем третью переменную и присваем ей целочисленный тип данных по условию задачи.
Third_book = int((First_book+Second_book)/2)
#Выводим результат.
print(First_book+Second_book+Third_book,"грн коштують всі три книги.")