# task 01 == Виправте синтаксичні помилки
# ВОт тут я не совсем понял задание. Просто отступ убрать? Что за end? Я понял, что пустую строку добавили. Пчему принтуется в одну строку в консоль, а не в две?
print("Hello", end = " ")
print("world!")
print("\n" * 3)
# task 02 == Виправте синтаксичні помилки
# f-ка это что, конкатенация или как это называется?
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")
print("\n" * 3)
# # task 03  == Вcтавте пропущену змінну у ф-цію print
# "Объекты" то мы вперед забегаем, а циклы норм?) Ну ок, Сатана
for letter in "Hello world!":
    print(letter)
# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4
print(banana)
print("\n" * 3)
# # task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4
print(storona_1, storona_2, storona_3, storona_4)
print("\n" * 3)
#
# # task 06 == Порахуйте периметр фігури з task 05
# # та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)
print("\n" * 3)
#
#
# """
#     # Задачі 07 -10:
#     # Переведіть задачі з книги "Математика, 2 клас"
#     # на мову пітон і виведіть відповідь, так, щоб було
#     # зрозуміло дитині, що навчається в другому класі
# """
# # task 07
# """
# У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
# Скільки всього дерев посадили в саду?
# """
# Смотри сынок, это ПАЙТОН. Освоишь его и тебе никогда ьне придеться считать какую-то хрень в столбик
# Давай сначало объявим переменные для всех деревьев. Яблони запишим числом (int\Number), а другие деревья
# "переменная яблони" + или - сколько там от тебя хочет училка. Потом выполним команду print (это вывод в консоль)
# "переменная яблонь" + "переменная груш" + "переменная слив". И дело в шляпе)
appple_trees = 4
pear_trees = appple_trees + 5
plum_trees = appple_trees - 2
total_quantity_of_all_trees = appple_trees + pear_trees + plum_trees
print(f"В саду у нас {appple_trees} яблонь, {pear_trees} груш (на 5 больше, чем яблок) и {plum_trees} слив (на 2 меньше, чем яблонь).")
print(f"Итого у нас получилось {total_quantity_of_all_trees} фруктовыйх деревьев. Передавай привет Марье Ивановне)).")
print("\n" * 3)
# # task 08
# """
# До обіда температура повітря була на 5 градусів вище нуля.
# Після обіду температура опустилася на 10 градусів.
# Надвечір потепліло на 4 градуси. Яка температура надвечір?
# """
zero_constanta_temperature = 0
morning_temperature = zero_constanta_temperature + 5
day_temperature = morning_temperature - 10
evening_temperature = day_temperature + 4
print(f"Вранці температура була на {morning_temperature} градусів вище {zero_constanta_temperature}.")
print(f"Після обіду температура опустилася на 10 градусів, і стала {day_temperature} градусів.")
print(f"Надвечір температура піднялася на 4 градуси, тому тепер {evening_temperature} градусів.")
print("\n" * 3)
#
# # task 09
# """
# Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
# 1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
# Скількі сьогодні дітей у театральному гуртку?
# """
boys = 24
girls = boys * 2
sick_boys = 1
absent_girls = 2
total_quantity_of_childrens = (boys + girls) - (sick_boys + absent_girls)
print(f"У театральному гуртку {boys} хлопчики та {girls} дівчаток (їх вдвічі більше, ніж хлопчиків).")
print(f"Сьогодні {sick_boys} хлопчик захворів, а {absent_girls} дівчинки не прийшли.")
print(f"Загалом сьогодні у гуртку {total_quantity_of_childrens} дітей.")
print("\n" * 3)
#
# # task 10
# """
# Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
# а третя - як половина вартості першої та другої разом.
# Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
# """
book_1 = 8
book_2 = book_1 + 2
book_3 = (book_1 + book_2) / 2
total_cost_of_all_books = book_1 + book_2 + book_3
print(f"Перша книжка коштує {book_1} грн.")
print(f"Друга книжка на 2 грн. дорожче за першу, отже її ціна {book_2} грн.")
print(f"Третя книжка коштує як половина вартості першої та другої разом, тобто {book_3} грн.")
print(f"Загалом усі три книжки разом коштують {total_cost_of_all_books} грн.")