# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4 # ВИПРАВЛЕНО
print("Кількість бананів: ", banana)

# task 05 == виправте назви змінних
storona_1 = 1 # ВИПРАВЛЕНО
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4 # ВИПРАВЛЕНО
print("Периметр фігури: ", perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apple = 4
pear = apple + 5
plum = apple - 2
sum_of_friut_trees = apple + pear + plum

print("Яблуні = ", apple)
print("Груші = Яблуні + 5 = 4 + 5 = ", pear )
print("Сливи = Яблуні - 2 = 4 - 2 = ", plum)
print("Всього дерев в саду = Яблуні + Груші + Сливи = 4 + 9 + 2 = ", sum_of_friut_trees)

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
before_afternoon = 5
print("Температура до обіду = ", before_afternoon)
after_afternoon = int(input("Визначимо температуру після обіду: потрібно відняти число 10 від значення температури до обіду і записати: "))
if after_afternoon == -5:
    print("Вірно! Температура пілся обіду = -5")
else:
    print("Ти помилився в розрахунках, правильна відповідь: -5")
evening = int(input("Визначимо температуру надвечір: потрібно додати число 4 до значення температури після обіду і записати: "))
if evening == -1:
    print("Молодець! Ти правильно вирішив(ла) задачу. Температура надвечір = -1")
else:   
    print("Ти помилився(помилилася) в розрахунках. -5 + 4 = -1")

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = int(24)
girls = int(boys / 2)
boys_today = int(boys - 1)
girls_today = int(girls - 2)
kids_today = int(boys_today + girls_today)

print("Загальна кількість хлопчиків у гуртку: ", boys)
print("Визначимо загальну кількість дівчат у гуртку: число 24 / 2 = ", girls)
print("Визначимо, скільки хлопчиків прийшло сьогодні, віднімемо 1 від загальной кількості хлопчиків: 24 - 1 = ", boys_today)
print("Визначимо, скільки дівчат прийшло сьогодні, віднімемо 2 від загальной кількості дівчат: 12 - 2 = ", girls_today)
kids_today = int(input("Тепер порахуй, скільки дітей прийшло сьогодні: додай до кількості хлопчиків сьогодні кількість дівчат сьогодні і запиши: "))
if kids_today == 33:
    print("Ти впорався(впоралася)! Задача вирішена правильно")
else:
    print("Помилка у розрахунках. 23 + 10 = 33")
    
# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
book_1 = int (8)
book_2 = int(book_1 + 2)
sum_book_1_and_2 = int (book_1 + book_2)
book_3 = int (sum_book_1_and_2/2)
all_books = book_1 + book_2 + book_3

print("Ціна першої книжки: ", book_1)
print("Ціна другої книжки -> додати 2 до ціни першої книжки: 8 + 2 = ", book_2)
print("Ціна першої та другої книжки разом -> сума цін першої книжки та другої книжки: 8 + 10 = ", sum_book_1_and_2 )
print("Ціна третьої книжки -> розділити суму першої та другої книжок на 2: 18 / 2 = ", book_3)
all_books = int(input("Маючи ціну кожної книжки, порахуй суму усіх трьох книжок по одному примірнику, це буде - ціна книжки 1 + ціна книжки 2 + ціна книжки 3 -> запиши: "))
if all_books == 27:
    print("Супер! Ти правильно вирішив(ла) задачу")
else:
    print("Ти помилився. 8 + 10 + 9 = 27")
