"""
Створіть клас геометричної фігури "Ромб". Клас повинен мати наступні атрибути:

    сторона_а (довжина сторони a).
    кут_а (кут між сторонами a і b).
    кут_б (суміжний з кутом кут_а).

Необхідно реалізувати наступні вимоги:

    Значення сторони сторона_а повинно бути більше 0.
    Кути кут_а та кут_б повинні задовольняти умову: кут_а + кут_б = 180
    Протилежні кути ромба завжди рівні, тому при заданому значенні кут_а, значення
    кут_б обчислюється автоматично.
    Для встановлення значень атрибутів використовуйте метод __setattr__.
"""


class Rhombus:
    def __init__(self, side_a, angle_a):
        self.side_a = side_a
        self.angle_a = angle_a

    def __setattr__(self, name, value):
        if name == "side_a" and value <= 0:
            raise ValueError("Довжина сторони повинна бути більше 0")

        if name == "angle_a":
            if not (0 < value < 180):
                raise ValueError("Кут повинен бути між 0 і 180 градусами")

            super().__setattr__("angle_b", 180 - value)

        super().__setattr__(name, value)

    def __str__(self):
        return f"Ромб: сторона={self.side_a}, кут_а={self.angle_a}, кут_б={self.angle_b}"



rhombus = Rhombus(5, 60)
print(rhombus)  # Ромб: сторона=5, кут_а=60, кут_б=120
