# task 1
"""  Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо так, надрукуйте повідомлення про те, що гравець щойно заробив 5 балів.
"""
print("task 1")
alien_color = "green"
if alien_color == "green":
    print("Гравець щойно заробив 5 балів.")
print("___________________________________________________________")

# task 2
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою else.
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Зробіть так, щоб виводилася умова else.
"""
print("task 2")
alien_color = "yellow"
if alien_color == "green":
    print("Гравець щойно заробив 5 балів.")
else:
    print("Гравець щойно заробив 10 балів.")
print("___________________________________________________________")

# task 3
# task 4
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою elif.
змінну під назвою alien_color перетворіть у список значень: 'green', 'yellow', 'red'
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Якщо прибулець червоний, надрукуйте повідомлення про те, що гравець заробив 15 очок
+ напишіть цикл for що перебере і обробить всі значення списку alien_color
"""
print("task 3, 4")
alien_color = ["green", "yellow", "red"]
for color in alien_color:
    if color == "green":
        print("Гравець щойно заробив 5 балів.")
    elif color == "red":
        print("Гравець щойно заробив 15 балів.")
    else:
        print("Гравець щойно заробив 10 балів.")
print("___________________________________________________________")

# task 5
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""
print("task 5")
pizza_topping = ""
while pizza_topping != "quit":
    pizza_topping = input("Введіть начинку для піци: ")
    if pizza_topping != "quit":
        print(f"Додано {pizza_topping} до піци.")
print("___________________________________________________________")

# task 6
"""  Напишіть програму, яка знаходить суму всіх цифр натурального числа, яке вводить користувач.
Для перебору вводу від користувача використовуйте цикл. Виведіть суму цифр числа на екран.
Приклад виконання програми:
Введіть натуральне число: 12345
Сума цифр числа 12345: 15
"""
print("task 6")
number = input("Введіть натуральне число: ")
sum_number = 0
for digit in number:
    sum_number += int(digit)
print(f"Сума цифр числа {number}: {sum_number}")
print("___________________________________________________________")

# task 7
"""  Потрібно написати програму, яка просить користувача ввести числа, доки він не введе 0.
Програма повинна підрахувати суму всіх введених чисел, окрім 0, і вивести її на екран.
Це повинно працювать як калькулятор, в який ввів цифру - нажав плюс - ввів наступну цифру.
Після введеня 0 показує результат сумування.
Розв'язати з використанням циклу while та break
"""
print("task 7")
sum_numbers = 0
while number != 0:
    number = int(input("Введіть число: "))
    if number == 0:
        break
    sum_numbers += number
print(f"Сума введених чисел: {sum_numbers}")
print("___________________________________________________________")

# task 8
"""  З використанням циклу for реалізуйте гру "Вгадай число".
Початок програми написаний, гравець має 5 спроб відгадати випадкове число від 1 до 20,
яке було згенеровано за допомогою функції randint() модуля random.
У кожній спробі гравець вводить своє припущення, після чого програма повідомляє, чи
було припущення занадто великим або занадто малим, чи гравець вгадав число.
"""
print("task 8")
import random
secret_number = random.randint(1, 20)
guesses = 0
max_guesses = 5
print("Вгадайте число від 1 до 20 за 5 спроб!")
for guesses in range(max_guesses):
    guess = int(input("Ваше припущення: "))
    if guess < secret_number:
        print("Ваше число замале.")
    elif guess > secret_number:
        print("Ваше число завелике.")
    else:
        print(f"Вітаємо! Ви вгадали число {secret_number}!")
        break
    guesses += 1
if guess != secret_number:
    print(f"Ви не вгадали число {secret_number}.")
print("___________________________________________________________")

# task 9
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
print("task 9")
fruits = ["apple", "banana", "orange", "grape", "mango"]
for fruit in fruits:
    if fruit == "orange":
        continue
    print(fruit)
print("___________________________________________________________")

# task 10
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
print("task 10")
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = []
for number in numbers:
    if number % 2 == 0:
        result.append(number ** 2)
print(result)  #  [4, 16, 36, 64, 100]
print("___________________________________________________________")
